# Q1
q1 = "修道は2025年で創始何年？"
q1L = ["1725", "2025", "1000"]
# Q2
q2 = "修道の校長先生は？"
q2L = ["上田先生", "蔵下先生", "田原先生"]
# Q3
q3 = "2024年度の共通テストから加わった科目は？"
q3L = ["体育", "情報", "家庭科"]

# とりあえず回答を入れる変数を作る
aL = [0,0,0]
# 答えの変数
uL = [1,3,2]

# pointは最初は0
point = 0

msg = ["残念。0点でした。頑張りましょう。","あなたの点数は1点でした。","あなたの点数は2点でした。","素晴らしい！3点満点です！"]

print("問題1:",q1)
print("1.",q1L[0],"2.",q1L[1],"3.",q1L[2])
aL[0] = int(input("問題1:"))

print("問題2:",q2)
print("1.",q2L[0],"2.",q2L[1],"3.",q2L[2])
aL[1] = int(input("問題2:"))

print("問題3:",q3)
print("1.",q3L[0],"2.",q3L[1],"3.",q3L[2])
aL[2] = int(input("問題3:"))

point += int((aL[0] == uL[0]))
point += int((aL[1] == uL[1]))
point += int((aL[2] == uL[2]))

print(msg[point])